<a href="https://colab.research.google.com/github/Ebuka007/Data-Science/blob/main/Assignment_Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/Ebuka007/My-Data2.git

Cloning into 'My-Data2'...
remote: Enumerating objects: 9, done.
remote: Counting objects: 100% (9/9), done.
remote: Compressing objects: 100% (7/7), done.
remote: Total 9 (delta 0), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (9/9), done.

In [5]:
# Read CSV file using pandas
import pandas as pd
sucidesindia=pd.read_csv('/content/My-Data2/SuicidesIndia.csv')
sucidesindia.head()

           State  Year Type_code  ...  Gender Age_group Total
0  A & N Islands  2001    Causes  ...  Female      0-14     0
1  A & N Islands  2001    Causes  ...  Female      0-14     0
2  A & N Islands  2001    Causes  ...  Female      0-14     0
3  A & N Islands  2001    Causes  ...  Female      0-14     0
4  A & N Islands  2001    Causes  ...  Female      0-14     0

[5 rows x 7 columns]

In [29]:
#Grouping by Age
Age = sucidesindia.groupby(['Age_group']).count()
Age.sort_values(['Age_group'],ascending=True)

           State   Year  Type_code   Type  Gender  Total
Age_group
0-100+     11856  11856      11856  11856   11856  11856
0-14       45027  45027      45027  45027   45027  45027
15-29      45223  45223      45223  45223   45223  45223
30-44      45193  45193      45193  45193   45193  45193
45-59      45146  45146      45146  45146   45146  45146
60+        45074  45074      45074  45074   45074  45074

In [47]:
age = sucidesindia.groupby(['Age_group','Year'])
age.sum()

                 Total
Age_group Year
0-100+    2001  651036
          2002  662502
          2003  665106
          2004  682182
          2005  683484
...                ...
60+       2008   27632
          2009   30271
          2010   33319
          2011   32340
          2012   32136

[72 rows x 1 columns]

In [49]:
age = sucidesindia.groupby(['Age_group'])
Age_extract=age.sum()
Age_extract

               Year    Total
Age_group
0-100+     23789064  8735586
0-14       90346704    98410
15-29      90740018  1534037
30-44      90679742  1471599
45-59      90585456   885177
60+        90440996   346925

In [ ]:
age = sucidesindia.groupby(['Age_group'])
Age_extract=age.sum()
Age_extract.plot(kind='bar');